package com.telegramBot.nutricion.dictionaries;

public interface TextNormal {

    String MENU_FOURTH =
            """
            🚩Оптимальный возраст введения прикормов для вашего ребенка – 5 месяцев. Раннее начало нежелательно.
            """;

    String MENU_FIFTH_HEALTHY =
                """
                ❗5 месяцев – это рекомендуемый возраст для начала введения прикормов. Мы предлагаем ознакомиться с правилами в разделе «Календарь и правила введения прикормов»
                ⏰Рекомендуемый интервал кормления: каждые 3,5 – 4 часа (6 раз в день).
                📌Каждый прием пищи, должен укладываться в рассчитанный для вашего ребенка разовый объем.
                                
                📖Пример меню:
                7:00   АМС/ГМ* (разовый объем)
                10:30 – Безмолочная каша, разведенная АМС/ГМ* (75 г)\s
                        Фруктовое пюре 20 г.\s
                        Овощное пюре 50 г.
                        Растительное масло ½ ч.л.
                14:00 – АМС/ГМ* (разовый объем)
                17:30 – Безмолочная каша, разведенная АМС/ГМ* (75 г)\s
                        Сливочное масло 3 г .
                        Фруктовое пюре 30 г.
                21:00 – Овощное пюре 50 г. \s
                        Докорм АМС/ГМ* (до разового объема)
                00:00 – АМС/ГМ*
                🌙Ночное кормление
                *АМС – адаптированная молочная смесь
                *ГМ – грудное молоко
                """;

    String DESCRIPTION_FIFTH_HEALTHY =
            """
                🥦Монокомпонентное овощное пюре начинать с 10 г.  (2 ч.л.) постепенно довести до дневной нормы 150 г. (30 ч.л) + добавить растительное масло 1-3 мл.
                Рекомендуемые овощи: брокколи, кабачок, цветная капуста. Подробнее можно узнать в разделе «Узнать о пользе продуктов»
                🥣Монозлаковая безмолочная каша начинать, разведенная на адаптированной молочной смеси или грудном молоке. Начиная  с 10 г. (2 ч.л.) постепенно довести до дневной нормы 150 г.  (30 ч.л.) +  добавить сливочное масло 1-3 г.\s
                🍏Фруктовое пюре начиная с 5 г. (1 ч.л.) постепенно доводя до 50 мл = 10 ч.л. (не в качестве первого прикорма!).
                """;

    String MENU_SIXTH_HEALTHY =
            """
                ⏰Рекомендуемый интервал кормления: каждые 4 часа (5 раз в день).
                📌Каждый прием пищи, должен укладываться в рассчитанный для вашего ребенка разовый объем.
                                
                📖Пример меню:
                7:00 – АМС/ГМ* (разовый объем)
                11:00 - Безмолочная каша, разведенная АМС/ГМ* (150 г.)\s
                      Масло сливочное 4 г.
                      Докорм АМС/ГМ*  (до разового объема)\s
                15:00 - Овощное пюре 150 г.
                        Мясное пюре 30 г.
                        Растительное масло 1 ч.л.
                        Докорм АМС/ГМ* (до разового объема)\s
                19:00 - Фруктовое пюре 60 г.
                        Докорм АМС/ГМ* (до разового объема)\s
                23:00 - АМС/ГМ* (разовый объем)
                🌙 Ночное кормление
                * ГМ – грудное молоко
                * АМС – адаптированная молочная смесь\s
                """;

    String DESCRIPTION_SIXTH_HEALTHY =
            """
                🥩Новый продукт этого возраста: Мясное пюре. Начиная с 5 г. (1 ч.л), постепенно доводим до суточной нормы - 30 г.
                🥦Овощное пюре дневная норма 150 г. + добавить растительное масло 1 ч.л.
                🥣Монозлаковая безмолочная каша, разведенная на адаптированной молочной смеси или грудном молоке. Дневная норма продукта: 150 г. + добавить сливочное масло 4 г.\s
                🍏 Фруктовое пюре. Дневная норма: 60 г.
                """;

    String MENU_SEVENTH_HEALTHY =
            """
                ⏰Рекомендуемый интервал кормления: каждые 4 часа (5 раз в день).
                📌Каждый прием пищи, должен укладываться в рассчитанный для вашего ребенка разовый объем.
                                
                📖 Пример меню:
                7:00 - АМС/ГМ* (разовый объем)
                11:00 - Безмолочная каша, разведенная АМС/ГМ* (150 г.)\s
                        Сливочное масло 5 г.
                        Желток вареного куриного яйца ¼ (добавить в кашу)\s
                        Докорм АМС/ГМ* (до разового объема)\s
                15:00 - Овощное пюре 150 г.
                        Растительное масло 1 ч.л.
                        Мясное пюре 45 г.
                19:00 - Фруктовое пюре 70 г.
                        Докорм АМС/ГМ* (до разового объема)
                23:00 - АМС/ГМ* (разовый объем)
                🌙Ночное кормление
                * ГМ – грудное молоко
                * АМС – адаптированная молочная смесь\s
                """;

    String DESCRIPTION_SEVENTH_HEALTHY =
        """
                🥚Новый продукт этого возраста: Яичный желток. 1/4 желтка, добавляем в кашу. Подробнее можно узнать в разделе «Узнать о пользе продуктов»
                🥦Овощное пюре дневная норма 150  г. + Добавить растительное масло 1 ч.л.
                🥣 Безмолочная каша, разведенная на адаптированной молочной смеси или грудном молоке. Дневная норма продукта: 150 г. + добавить сливочное масло 5 г.\s
                🍏Фруктовое пюре. Дневная норма: 70 г.
                🥩 Мясное пюре. Дневная норма: 40-50 г.
                """;

    String MENU_EIGHTH_HEALTHY =
            """
                ⏰Рекомендуемый интервал кормления: каждые 4 часа (5 раз в день).
                📌Каждый прием пищи, должен укладываться в рассчитанный для вашего ребенка разовый объем.
                                
                📖 Пример меню:
                7:00 - АМС/ГМ* (разовый объем)
                11:00 - Безмолочная каша, разведенная АМС/ГМ* (180 г.)
                        Сливочное масло 5 г.\s
                        Желток вареного куриного яйца 1/2 (добавить в кашу)
                        Фруктовое пюре 30 г.\s
                15:00 - Овощное пюре 150 г.
                        Растительное масло 6 мл.
                        Мясное пюре 70 г.
                19:00 - Творог 40 г.
                        Детское печенье 5г.(1 шт.)
                        Фруктовое пюре 50 г.
                        Докорм АМС/ГМ *(до разового объема)\s
                23:00 Кефир 200 мл.
                🌙 Ночное кормление
                * ГМ – грудное молоко
                * АМС – адаптированная молочная смесь\s
                """;

String DESCRIPTION_EIGHTH_HEALTHY =
        """
                ✨Новый продукты этого возраста: Рыбное пюре, кисломолочные продукты (творог, кефир), хлебобулочные изделия (хлеб пшеничный, детское печенье, сухари)
                🐟  Рыбное пюре. Начиная с 5 г., постепенно довести до дневной нормы: 30 г. Давать не реже 2 раз в неделю, заменяя мясного пюре.
                🥛 Кисломолочные продукты: суточная норма творога: 10-40 г, кефира: 200 мл
                🍞 Хлебобулочные изделия: хлеб пшеничный, сухари 5 г., детское печенье 5 г. (1 шт.)
                🥦 Овощное пюре дневная норма 150 мл + добавить растительное масло 6 мл.
                🥣 Безмолочная каша, разведенная на адаптированной молочной смеси или грудном молоке. Дневная норма продукта: 180 г. + добавить сливочное масло 5 г.\s
                🍏Фруктовое пюре. Дневная норма: 80 г.
                🥩 Мясное пюре. Дневная норма: 60-70 г.
                🥚 Яичный желток: 1/2 желтка, добавляем в кашу.
                """;

String MENU_NINTH_TO_TWELFTH_HEALTHY =
        """
                ❗ В этом возрасте должна меняться консистенция продуктов от гомогенизированной переходим к мелко- и крупноизмельченной
                ⏰Рекомендуемый интервал кормления: каждые 4 часа (5 раз в день).
                📌Каждый прием пищи, должен укладываться в рассчитанный для вашего ребенка разовый объем.
                                
                📖 Пример меню:
                7:00 - АМС/ГМ* (разовый объем)
                11:00 - Безмолочная каша, разведенная АМС/ГМ* (100 г.)
                       Сливочное масло 5 г.
                       Желток вареного куриного яйца 1/2 (добавить в кашу)
                       Фруктовое пюре 80 г.\s
                       Сухарик 5 г.
                15:00 - Овощное пюре 150 г.
                        Растительное масло 2 ч.л.
                        Отварная курица 40 г.
                19:00 - Творог 50 г.
                        Фруктовое пюре 20 г.
                        Печенье 10 г. (2 шт.)
                        Докорм АМС/ГМ * (до разового объема)\s
                23:00 - Кефир 200 мл.
                🌙 Ночное кормление
                * ГМ – грудное молоко
                * АМС – адаптированная молочная смесь
                """;

    String DESCRIPTION_NINTH_TO_TWELFTH_HEALTHY =
            """
                🧃 Новый продукты этого возраста: Все прикормы введены, можно добавить соки  80-100 мл. в день.
                🐟   Отварная рыба 30-60 г. Давать не реже 2 раз в неделю, заменяя мясо.
                🥛 Кисломолочные продукты: суточная норма творога: 50 г, кефира: 200 мл
                🍞 Хлебобулочные изделия: хлеб пшеничный, сухари 5 г., детское печенье 10 г. (2 шт.)
                🥦 Овощное пюре дневная норма 150 мл + добавить растительное масло 10 мл. (2 ч.л.)
                🥣  Безмолочная каша, разведенная на адаптированной молочной смеси или грудном молоке. Дневная норма
                продукта: 200 г. + добавить сливочное масло 5 г.\s
                🍏Фруктовое пюре. Дневная норма: 90-100 г.
                🥩  Отварное мясо. Дневная норма: 40-50 г
                🥚 Яичный желток: 1/2 желтка, добавляем в кашу.
                """;
}
