package com.telegramBot.nutricion.dictionaries;

public interface TextNormalRegurgitation {

    String MENU_FOURTH =
            """
            ❗4 месяца – это рекомендуемый возраст для начала введения прикормов, для детей с частыми срыгиваниями. Первым продуктом предпочтительно ввести  каши.
            ⏰Рекомендуемый интервал кормления: каждые 3,5 – 4 часа (6 раз в день).
            📌Каждый прием пищи, должен укладываться в рассчитанный для вашего ребенка разовый объем.
                                
            📖 Пример меню:\s
            7:00 - Безмолочная каша, разведенная АМС/ГМ (20 мл)\s
                   Докорм АМС/ГМ (до разового объема)
            14:00 – Безмолочная каша, разведенная АМС/ГМ (20 мл)\s
                    Докорм АМС/ГМ (до разового объема)
            17:30 – Безмолочная каша, разведенная АМС/ГМ (20 мл)
                    Докорм АМС/ГМ (до разового объема)
            21:00 – Безмолочная каша, разведенная АМС/ГМ (20 мл)
                    Докорм АМС/ГМ (до разового объема)
            00:00 – Безмолочная каша, разведенная АМС/ГМ (20 мл)\s
                    Докорм АМС/ГМ (до разового объема)
            🌙Ночное кормление
            *АМС – адаптированная молочная смесь
            *ГМ – грудное молоко
            """;

    String DESCRIPTION_FOURTH =
            """
             🥣Первый продукт: Монозлаковая безмолочная каша, разведенная на адаптированной молочной смеси или грудном молоке 20-30 мл до кормления грудью.
             """;

    String MENU_FIFTH =
                """
                ⏰Рекомендуемый интервал кормления: каждые 3,5 – 4 часа (6 раз в день).
                📌Каждый прием пищи, должен укладываться в рассчитанный для вашего ребенка разовый объем.
                                        
                📖Пример меню:
                7:00 - Безмолочная каша, разведенная АМС/ГМ (20 мл)
                       Докорм АМС/ГМ (до разового объема)
                10:30 – Безмолочная каша, разведенная АМС/ГМ (55 г)\s
                        Фруктовое пюре 20 г.\s
                        Овощное пюре 50 г.
                        Растительное масло ½ ч.л.
                14:00 – АМС/ГМ (разовый объем)
                17:30 – Безмолочная каша, разведенная АМС/ГМ (55 г)\s
                        Сливочное масло 3 г .
                        Фруктовое пюре 30 г.
                21:00 – Овощное пюре (50 \s
                        Докорм АМС/ГМ (до разового объема)
                00:00 – Безмолочная каша, разведенная АМС/ГМ (20 мл)
                        Докорм АМС/ГМ (до разового объема)
                🌙Ночное кормление
                *АМС – адаптированная молочная смесь
                *ГМ – грудное молоко
                """;

    String DESCRIPTION_FIFTH =
            """
            🥦Монокомпонентное овощное пюре начинать с 10 г.  (2 ч.л.) постепенно довести до дневной нормы 150 г. (30 ч.л) + добавить растительное масло 1-3 мл.
            Рекомендуемые овощи: брокколи, кабачок, цветная капуста. Подробнее можно узнать в разделе «Узнать о пользе продуктов»
            🥣Монозлаковая безмолочная каша начинать, разведенная на адаптированной молочной смеси или грудном молоке. Начиная  с 10 г. (2 ч.л.) постепенно довести до дневной нормы 150 г.  (30 ч.л.) +  добавить сливочное масло 1-3 г. (также 20-30 г. до кормления грудью.)
            🍏Фруктовое пюре начиная с 5 г. (1 ч.л.) постепенно доводя до 50 мл = 10 ч.л. (не в качестве первого прикорма!)
            """;
}
