package com.telegramBot.nutricion.dictionaries;

public interface TextVeryThick {

    String MENU_FOURTH_VERY_THICK =
            """
            ⏰Рекомендуемый интервал кормления: каждые 3,5 – 4 часа (6 раз в день).
            📌Каждый прием пищи, должен укладываться в рассчитанный для вашего ребенка разовый объем.
                                
            📖Пример меню:
            7:00 - АМС/ГМ(разовый объем)
            10:30 – Овощное пюре 100 г.
                    Докорм АМС/ГМ (до разового объема)
            14:00 – АМС/ГМ (разовый объем)
            17:30 – Овощное пюре 100 г.
                    Докорм АМС/ГМ (до разового объема)
            21:00 –АМС/ГМ (разовый объем)
            00:00 – АМС/ГМ (разовый объем)
            🌙Ночное кормление
            *АМС – адаптированная молочная смесь
            *ГМ – грудное молоко
            """;

    String DESCRIPTION_FOURTH_VERY_THICK =
            """
            🥦Монокомпонентное овощное пюре начинать с 10 мл (2 ч.л.) постепенно довести до дневной нормы 150 мл (30 ч.л) без добавления масла, давать в два кормления (по 70−100 г), уменьшая объем детской молочной смеси (АМС) или грудного молока (ГМ).
            Низкокалорийные овощные пюре: капуста, кабачки.
            🥣 Детские безмолочные каши без сахара следует вводить промышленного выпуска после мясного пюре ― в 6 мес.
            """;

    String MENU_FIFTH_VERY_THICK =
            """
            ⏰Рекомендуемый интервал кормления: каждые 3,5 – 4 часа (6 раз в день).
            📌Каждый прием пищи, должен укладываться в рассчитанный для вашего ребенка разовый объем.
            
            📖Пример меню:
            7:00 - АМС/ГМ(разовый объем)
            10:30 – Безмолочная каша, разведенная водой (75 г)\s
                    Фруктовое пюре 20 г.\s
                    Овощное пюре 50 г.
            14:00 – АМС/ГМ (разовый объем)
            17:30 – Безмолочная каша, разведенная водой (75 г)\s
                    Фруктовое пюре 30 г.
            21:00 – Овощное пюре (50 \s
                    Докорм АМС/ГМ (до разового объема)
                    00:00 – АМС/ГМ
            🌙Ночное кормление
            *АМС – адаптированная молочная смесь
            *ГМ – грудное молоко
            """;

    String DESCRIPTION_FIFTH_VERY_THICK =
            """
            🍏Новый продукты этого месяца: Фруктовое пюре начиная с 5 г. (1 ч.л.) постепенно доводя до 50 мл = 10 ч.л.\s
            🥦Монокомпонентное овощное пюре начинать с 10 мл (2 ч.л.) постепенно довести до дневной нормы 150 мл (30 ч.л) без добавления масла, давать в два кормления (по 70−100 г), уменьшая объем детской молочной смеси (АМС) или грудного молока (ГМ).
            Низкокалорийные овощные пюре: капуста, кабачки.
            🥣 Детские безмолочные каши без сахара следует вводить промышленного выпуска после мясного пюре ― в 6 мес.
            """;

    String MENU_SIXTH_VERY_THICK =
            """
            ⏰Рекомендуемый интервал кормления: каждые 4 часа (5 раз в день).
            📌Каждый прием пищи, должен укладываться в рассчитанный для вашего ребенка разовый объем.
            
            📖Пример меню:
            7:00 – АМС/ГМ (разовый объем)
            11:00 - Безмолочная каша, разведенная водой (150 г.)\s
                    Овощное пюре 100 г.
                    Докорм АМС/ГМ  (до разового объема)\s
            15:00 - Овощное пюре 100 г.
                    Мясное пюре 30 г
                    Докорм АМС/ГМ (до разового объема)\s
            19:00 - Фруктовое пюре 60 г.
                    Докорм АМС/ГМ (до разового объема)\s
            23:00 - АМС/ГМ (разовый объем)
            🌙 Ночное кормление
            * ГМ – грудное молоко
            * АМС – адаптированная молочная смесь\s
            """;

    String DESCRIPTION_SIXTH_VERY_THICK =
            """
            ✨Новый продукты этого возраста: Мясное пюре и каши.
            🥩Мясное пюре. Начиная с 5 г. (1 ч.л), постепенно доводим до суточной нормы - 30 г
            🥣Детские безмолочные каши без сахара промышленного выпуска, разведенные водой, без добавления масла, давать начиная  с 10 г. (2 ч.л.) постепенно довести до дневной нормы 150 г.  (30 ч.л.). После введения в рацион мясного пюре.
            🥦Овощное пюре без добавления масла  давать в два кормления (по 70−100 г), уменьшая объем детской молочной смеси (АМС) или грудного молока (ГМ).
            Низкокалорийные овощные пюре: капуста, кабачки.
            🍏 Фруктовое пюре. Дневная норма: 60 г.
            """;

    String MENU_SEVENTH_VERY_THICK =
            """
            ⏰Рекомендуемый интервал кормления: каждые 4 часа (5 раз в день).
            📌Каждый прием пищи, должен укладываться в рассчитанный для вашего ребенка разовый объем.
                                
            📖 Пример меню:
            7:00 - АМС/ГМ (разовый объем)
            11:00 - Безмолочная каша, разведенная водой (150 г.)\s
                    Овощное пюре 100 г.
                    Желток вареного куриного яйца ¼ (добавить в кашу)\s
                    Докорм АМС/ГМ (до разового объема)\s
            15:00 - Овощное пюре 100 г.
                    Мясное пюре 50 г.
            19:00 - Фруктовое пюре 70 г.
                    Докорм АМС/ГМ (до разового объема)
            23:00 - АМС/ГМ (разовый объем)
            🌙Ночное кормление
            * ГМ – грудное молоко
            * АМС – адаптированная молочная смесь\s
            """;

    String DESCRIPTION_SEVENTH_VERY_THICK =
            """
            Новый продукт этого возраста: Яичный желток. 1/4 желтка, добавляем в кашу. Подробнее можно узнать в разделе «Узнать о пользе продуктов»
            🥦Овощное пюре, без добавления масла. Дневная норма: 150  г.\s
            🥣 Безмолочные каши без сахара промышленного выпуска, разведенные водой, без добавления масла. Дневная норма продукта: 150 г.\s
            🍏Фруктовое пюре. Дневная норма: 70 г.
            🥩 Мясное пюре. Дневная норма: 40-50 г
            """;

    String MENU_EIGHTH_VERY_THICK =
            """
            ⏰Рекомендуемый интервал кормления: каждые 4 часа (5 раз в день).
            📌Каждый прием пищи, должен укладываться в рассчитанный для вашего ребенка разовый объем.
                                
            📖Пример меню:
            7:00 – АМС/ГМ (разовый объем)
            11:00 - Безмолочная каша, разведенная водой (180 г.)\s
                    Овощное пюре 100 г.
                    Докорм АМС/ГМ  (до разового объема)\s
            15:00 - Овощное пюре 100 г.
                    Мясное пюре 30 г
                    Растительное масло 1 ч.л.
                    Докорм АМС/ГМ (до разового объема)\s
            19:00 - Фруктовое пюре 60 г.
                    Докорм АМС/ГМ (до разового объема)\s
            23:00 - АМС/ГМ (разовый объем)
            🌙 Ночное кормление
            * ГМ – грудное молоко
            * АМС – адаптированная молочная смесь\s
            """;

    String DESCRIPTION_EIGHTH_VERY_THICK =
            """
            ✨ Новый продукты этого возраста: Рыбное пюре, кисломолочные продукты (творог, кефир), хлебобулочные изделия (хлеб пшеничный, сухари)
            🐟  Рыбное пюре. Начиная с 5 г., постепенно довести до дневной нормы: 30 г. Давать не реже 2 раз в неделю, заменяя мясного пюре.
            🥛 Кисломолочные продукты: суточная норма творога: 10-40 г, кефира: 200 мл
            🍞 Хлебобулочные изделия: хлеб пшеничный, сухари 5 г.
            🥦 Овощное пюре дневная норма 150 мл.
            🥣 Безмолочные каши без сахара промышленного выпуска, разведенные водой, без добавления масла. Дневная норма продукта: 180 г.\s
            🍏 Фруктовое пюре. Дневная норма: 80 г.
            🥩 Мясное пюре. Дневная норма: 60-70 г
            🥚 Яичный желток: 1/2 желтка, добавляем в кашу.
            
            ⏰Рекомендуемый интервал кормления: каждые 4 часа (5 раз в день).
            📌Каждый прием пищи, должен укладываться в рассчитанный для вашего ребенка разовый объем.
            """;

    String MENU_NINTH_TO_TWELFTH_VERY_THICK =
            """
            ❗ В этом возрасте должна меняться консистенция продуктов от гомогенизированной переходим к мелко- и крупноизмельченной
            ⏰ Рекомендуемый интервал кормления: каждые 4 часа (5 раз в день).
            📌 Каждый прием пищи, должен укладываться в рассчитанный для вашего ребенка разовый объем.
            
            📖 Пример меню:
            7:00 - АМС/ГМ (разовый объем)
            11:00 - Безмолочная каша, разведенная водой (100 г.)\s
                    Желток вареного куриного яйца 1/2 (добавить в кашу)
                    Фруктовое пюре 80 г.\s
                    Сухарик 5 г.
            15:00 - Овощное пюре 150 г.
                    Отварная курица 40 г.
            19:00 - Творог 50 г.
                    Фруктовое пюре 20 г.
                    Печенье 10 г. (2 шт.)
                    Докорм АМС/ГМ (до разового объема)\s
            23:00 - Кефир 200 мл.
            🌙 Ночное кормление
            * ГМ – грудное молоко
            * АМС – адаптированная молочная смесь\s
            """;

    String DESCRIPTION_NINTH_TO_TWELFTH_VERY_THICK =
            """
            🐟 Отварная рыба 30-60 г. Давать не реже 2 раз в неделю, заменяя мясо.
            🥛 Кисломолочные продукты: суточная норма творога: 50 г, кефира: 200 мл
            🍞 Хлебобулочные изделия: хлеб пшеничный, сухари 5 г.
            🥦 Отварные овощи: дневная норма 150 мл.
            🥣 Безмолочные каши без сахара промышленного выпуска, разведенные водой, без добавления масла. Дневная норма продукта: 200г.\s
            🍏 Фруктовое пюре. Дневная норма: 90-100 г.
            🥩 Отварное мясо. Дневная норма: 40-50 г
            🥚 Яичный желток: 1/2 желтка, добавляем в кашу.
            """;
}
